
version_program = "v: 1.0.0.2 DEV | d: 15.02.2022"


def system(phrase):
    loc = {
        "boot_screen_false":
            "                                                                           ____ _    _   _ __  __ ______   __\n"
            "                                                                          / ___| |  | | | |  \/  / ___\ \ / /\n"
            "                                                                         | |   | |  | | | | |\/| \___ \\ V / \n"
            "                                                                         | |___| |__| |_| | |  | |___) || |  \n"
            "                                                                          \____|_____\___/|_|  |_|____/ |_|  \n"
            "                                                                                                             \n"
            "  ____             _               _   _           __        _______ ____                                            _ _   _                                _               __  \n"
            " |  _ \  ___ _ __ | | ___  _   _  | |_| |__   ___  \ \      / / ____| __ )   ___  ___ _ ____   _____ _ __  __      _(_) |_| |__    _   _  ___  _   _ _ __  | |_ ___   ___   \ \ \n"
            " | | | |/ _ \ '_ \| |/ _ \| | | | | __| '_ \ / _ \  \ \ /\ / /|  _| |  _ \  / __|/ _ \ '__\ \ / / _ \ '__| \ \ /\ / / | __| '_ \  | | | |/ _ \| | | | '__| | __/ _ \ / _ \ (_) |\n"
            " | |_| |  __/ |_) | | (_) | |_| | | |_| | | |  __/   \ V  V / | |___| |_) | \__ \  __/ |   \ V /  __/ |     \ V  V /| | |_| | | | | |_| | (_) | |_| | |    | || (_) |  __/  _| |\n"
            " |____/ \___| .__/|_|\___/ \__, |  \__|_| |_|\___|    \_/\_/  |_____|____/  |___/\___|_|    \_/ \___|_|      \_/\_/ |_|\__|_| |_|  \__, |\___/ \__,_|_|     \__\___/ \___| (_) |\n"
            "            |_|            |___/                                                                                                   |___/                                    /_/ \n"
            "                                                            _           _   _             ____                               ______     _ _ _    _       \n"
            "                                         ___ _ __ ___  __ _| |_ ___  __| | | |__  _   _  |  _ \ ___  _ __ ___   __ _ _ __   |__  / |__ (_) | | _(_)_ __  \n"
            "                                _____   / __| '__/ _ \/ _` | __/ _ \/ _` | | '_ \| | | | | |_) / _ \| '_ ` _ \ / _` | '_ \    / /| '_ \| | | |/ / | '_ \ \n"
            "                               |_____| | (__| | |  __/ (_| | ||  __/ (_| | | |_) | |_| | |  _ < (_) | | | | | | (_| | | | |  / /_| | | | | |   <| | | | |\n"
            "                                        \___|_|  \___|\__,_|\__\___|\__,_| |_.__/ \__, | |_| \_\___/|_| |_| |_|\__,_|_| |_| /____|_| |_|_|_|_|\_\_|_| |_|\n"
            "                                                                                  |___/                                                                  \n"
            "\n",

        "boot_screen":
            "                                 ____   _      _   _   __  __   ____  __   __                           \n"
            "                                / ___| | |    | | | | |  \/  | / ___| \ \ / /                           \n"
            "                               | |     | |    | | | | | |\/| | \___ \  \ V /                            \n"
            "                               | |___  | |___ | |_| | | |  | |  ___) |  | |                             \n"
            "                                \____| |_____\ \___/  |_|  |_| |____/   |_|                             \n"
            "                                                                                                        \n"
            "\n",

        "version_program":
            f"                            {version_program}",

        'description':
            '#                                                                                                      #\n'
            '#-------------------------------------------- C L U M S Y ---------------------------------------------#\n'
            '#                               Разверни WEB - сервер одним пальцем ноги.                              #\n'
            '#------------------------------------------------------------------------------------------------------#\n'
            '#                                                                                                      #',
        'error':
            '#---------------------------------------------------------------------------------------------#         \n'
            '#                                        О Ш И Б К А                                          #         \n'
            '#                       Неизвестный пункт меню, повторите, пожалуйста.                        #         \n'
            '#---------------------------------------------------------------------------------------------#         \n'
            '#                                                                                             #           ',
        'success':
            '#---------------------------------------------------------------------------------------------#         \n'
            '#                                        У С П Е Х                                            #\n'
            '#                            Интерфейс программы успешно обновлен.                            #\n'
            '#---------------------------------------------------------------------------------------------#\n'
            '#                                                                                             #',
        'warning':
            '#---------------------------------------------------------------------------------------------#\n'
            '#                                П Р Е Д У П Р Е Ж Д Е Н И Е                                  #\n'
            '#                            Интерфейс программы успешно обновлен.                            #\n'
            '#---------------------------------------------------------------------------------------------#\n'
            '#                                                                                             #',
        'info':
            '#                                                                                                      #\n'
            '#                                 .:: И Н Ф О Р М А Ц И Я ::.                                          #\n'
            '#                                                                                                      #\n'
            '#                        Статус: Запущен                                                               #\n'
            '#                        (1) - Начать процесс установки компонентов                                    #\n'
            '#                        (2) - Начать процесс удаления компонентов                                     #\n'
            '#                        (777) - Сменить язык                                                          #\n'
            '#                        (999) - Выйти из программы                                                    #\n'
            '#                                                                                                      #\n'
            '#                                                                                                      #',
        'menu':
            '#                                                                                                      #\n'
            '#                                       .:: М Е Н Ю ::.                                                #\n'
            '#                                                                                                      #\n'
            '#                        (0) - Обновить интерфейс                                                      #\n'
            '#                        (1) - Начать процесс установки компонентов                                    #\n'
            '#                        (2) - Начать процесс удаления компонентов                                     #\n'
            '#                        (777) - Сменить язык                                                          #\n'
            '#                        (999) - Выйти из программы                                                    #\n'
            '#                                                                                                      #\n'
            '#                                                                                                      #',
        'author':
            '#------------------------------------------------------------------------------------------------------#\n'
            f'#                  {version_program} | Создано с ❤ - @zhilllllka                 #\n'
            '#------------------------------------------------------------------------------------------------------#\n'
            '#                                                                                                      #\n',
        
        "launch_program":
            "\n\n -----------------------------------------------------------\n"
            "|   Запуск программы."
            " * Launching the program."
            " * 启动程序。|"
            "\n -----------------------------------------------------------\n"
            "~ | - Успешная операция * * ~\n"
            "~ || - Не удачная операция * * ~\n"
            "~ ||| - Предупреждение * * ~\n"
            "~ |||| - Фатальная операция * * ~\n"
            "~ ||||| - Завершение программы * * ~\n"
            f"~ {version_program}"
            "\n",

        "checking_file_settings":
            "Проверяю наличие файла настроек."
            " * "
            " * ",

        "checking_file_settings_true":
            " | Файл настроек обнаружен."
            " * "
            " * ",

        "checking_file_settings_false":
            " |||| Файл настроек не обнаружен."
            " * "
            " * ",

        "getting_settings_language":
            "Получаю информацию о языке в секции из настроек."
            " * "
            " * ",

        "getting_settings_language_true":
            " | Информация о языке в секции настроек - получена."
            " * "
            " * ",

        "checking_language":
            "Проверяю полученное значение языка."
            " * "
            " * ",

        "checking_language_true":
            " | Проверенное значение корректно для работы."
            " * "
            " * ",

        "checking_language_null":
            " ||| Полученное значение не имеет символов, не подходит для корректной работы."
            " * "
            " * ",

        "checking_language_valid":
            "Проверяю существование языка в языковых пакетах."
            " * "
            " * ",

        "checking_language_valid_true":
            " | Выбранный язык прошел проверку и пригоден для использования."
            " * "
            " * ",

        "checking_language_valid_false":
            " || Выбранный язык не пригоден для использования."
            " * "
            " * ",
    }

    return loc[phrase]


# RUSSIAN LOCALIZATION
def ru(phrase):
    loc = {
        "the language pack is loaded":
            " | Русский - выбранный языковой пакет.",

        "screensaver":
            "",

        "input":
            "Введите значение указанное в скобке: ",

        "":
            "",

        "":
            "",
    }

    return loc[phrase]


# RUSSIAN LOCALIZATION
def en(phrase):
    loc = {
        # Welcome
        "welcome":
            "CLUMSY - Deploying a web server with one toe. \n"
            f"{version_program}",
        # Select language
        "wle":
            "",

        "":
            "",

        "":
            "",

        "":
            "",

        "":
            "",
    }

    return loc[phrase]


def view(user_language, phrase):
    if user_language == "system":
        return system(phrase)

    elif user_language == "ru":
        return ru(phrase)

    else:
        exit(system("error"))


def check(language):

    return True
